# Lab 4: Intro to Python, Pandas, and Margin of Errors

<a>
  <img src="images/census_worker_1920s_reddit.jpg" width='800' height='1000'>
  <div style='width: 1000px; text-align: left;'>Census bureau worker in the 1920s.</div>
</a>

In this lab you will be familiarizing yourself with the programming language called Python. Python is a so-called high level programming language. Which means it is very abstracted from machine languages and are easily readable by humans. 

Python is one of the most popular programming languages nowadays, and is used in various spheres from research and Data Science to Machine Learning and Artificial Intelligence.

In this lab you will also learn:  
1. **Import a datset into Python (using one of the most popular Python libraries: Pandas)**  
2. **Use built-in functions**  
3. **Estimate margins of error from your datasets!**

## <font color='red'> 1. Datasets (Using Pandas)

Python libraries:  sets of different functions that you can import and use.  
One of the reasons that makes Python powerful are the libraries people write for it.  

The two most popular libraries are **numpy** and **pandas**.

Since we are using anaconda, a lot of libraries have been preloaded for you. You just need to "call" them. Just run the cell below. It will make our notebook know that we will be using these preinstalled libraries from that point on.

### Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Now that you are familiar with all the basics of Python coding, 
# it is time for you to learn how to work with Tables and Pandas Data Frames. 
# First let's upload the dataset we have selected to work on, using the pd.read_csv command.

broadway = pd.read_csv("data/broadway.csv")

# Note that you can also read in excels: pd.read_excel('example.xlsx')
# You can read in most data types: just look up pandas read [insert file type]

# The dataset.head() comments will show you the top few rows of the table that you loaded in

broadway.head(10)

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
0,5500,88,26,08/26/1990,134456,0,8,Tru,8,Booth,Play,1990
1,1737,100,24,03/24/1991,100647,0,3,Miss Saigon,0,Broadway,Musical,1991
2,12160,100,31,03/31/1991,634424,0,3,Miss Saigon,0,Broadway,Musical,1991
3,13921,100,7,04/07/1991,713353,0,4,Miss Saigon,0,Broadway,Musical,1991
4,10973,90,14,04/14/1991,573981,0,4,Miss Saigon,4,Broadway,Musical,1991
5,14076,101,21,04/21/1991,706793,0,4,Miss Saigon,8,Broadway,Musical,1991
6,14065,101,28,04/28/1991,714968,0,4,Miss Saigon,8,Broadway,Musical,1991
7,14064,101,5,05/05/1991,730765,0,5,Miss Saigon,8,Broadway,Musical,1991
8,13896,100,12,05/12/1991,766713,0,5,Miss Saigon,8,Broadway,Musical,1991
9,13738,99,19,05/19/1991,763332,0,5,Miss Saigon,8,Broadway,Musical,1991

In [4]:
# We can call a column in our dataset by typing:
# It will return an array of values. Think of every column in a Pandas table as a vertical list.

broadway['Name']

0                             Tru
1                     Miss Saigon
2                     Miss Saigon
3                     Miss Saigon
4                     Miss Saigon
                   ...
31291                  The Humans
31292               The Lion King
31293    The Phantom Of The Opera
31294                    Waitress
31295                      Wicked
Name: Name, Length: 31296, dtype: object

In [5]:
# You can work with arrays like they are lists. For example, we can index into them to extract one value:

broadway['Attendance'][6]

14065

In [6]:
# Since columns are lists, you can do Python arithmetic on them! 
# For example, we can divide Attendance by 1000 to get Audience per 1000s:

broadway['Attendance'] / 1000

0         5.500
1         1.737
2        12.160
3        13.921
4        10.973
          ...
31291     7.234
31292    13.485
31293    10.966
31294     8.058
31295    13.804
Name: Attendance, Length: 31296, dtype: float64

In [7]:
# Another neat thing you can do with pandas is filter out certain values.
# For example, if you only wanted to see Broadway shows from 2016, you can do the following

shows_2016 = broadway[broadway.Year == 2016]
shows_2016

#Note: Here we created a new table called "shows_2016".

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
30225,7074,87,3,01/03/2016,518228,59,1,A View From The Bridge 2015,8,Lyceum,Play,2016
30226,15542,100,3,01/03/2016,2398110,105,1,Aladdin,9,New Amsterdam,Musical,2016
30227,6997,83,3,01/03/2016,552338,60,1,Allegiance,8,Longacre,Musical,2016
30228,11546,86,3,01/03/2016,1349303,92,1,An American In Paris,8,Palace,Musical,2016
30229,7857,96,3,01/03/2016,1042635,86,1,Beautiful,8,Stephen Sondheim,Musical,2016
...,...,...,...,...,...,...,...,...,...,...,...,...
31291,7234,87,14,08/14/2016,603770,62,8,The Humans,8,Schoenfeld,Play,2016
31292,13485,99,14,08/14/2016,2233894,97,8,The Lion King,8,Minskoff,Musical,2016
31293,10966,85,14,08/14/2016,999632,66,8,The Phantom Of The Opera,8,Majestic,Musical,2016
31294,8058,96,14,08/14/2016,990128,97,8,Waitress,8,Brooks Atkinson,Musical,2016
31295,13804,95,14,08/14/2016,1779664,100,8,Wicked,8,Gershwin,Musical,2016

In [8]:
# Similarly, we can use other booleans like <, >.
# We can look at the all the Broadway shows before the 2000s:

shows_90s = broadway[broadway.Year < 2000]
shows_90s

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
0,5500,88,26,08/26/1990,134456,0,8,Tru,8,Booth,Play,1990
1,1737,100,24,03/24/1991,100647,0,3,Miss Saigon,0,Broadway,Musical,1991
2,12160,100,31,03/31/1991,634424,0,3,Miss Saigon,0,Broadway,Musical,1991
3,13921,100,7,04/07/1991,713353,0,4,Miss Saigon,0,Broadway,Musical,1991
4,10973,90,14,04/14/1991,573981,0,4,Miss Saigon,4,Broadway,Musical,1991
...,...,...,...,...,...,...,...,...,...,...,...,...
5973,10128,79,26,12/26/1999,715999,82,12,The Phantom Of The Opera,8,Majestic,Musical,1999
5974,2939,34,26,12/26/1999,118985,27,12,The Price 99,8,Royale,Play,1999
5975,5028,63,26,12/26/1999,183612,56,12,The Rainmaker,8,Brooks Atkinson,Play,1999
5976,3673,34,26,12/26/1999,195192,29,12,The Scarlet Pimpernel,8,Neil Simon,Musical,1999
5977,3817,50,26,12/26/1999,243125,54,12,Waiting In The Wings,8,Walter Kerr,Play,1999

In [9]:
# Finally, we can also sort a table by a certain column. This can be really helpful for understanding a dataset!
# For example, we can sort by Gross revenue:

money = broadway.sort_values(by = 'Gross', ascending = False)
money

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
26997,17352,100,29,12/29/2013,3201333,121,12,Wicked,9,Gershwin,Musical,2013
25603,16281,100,30,12/30/2012,2947172,156,12,Wicked,9,Gershwin,Musical,2012
24057,17375,100,1,01/01/2012,2941794,133,1,Spider-Man Turn Off The Dark,9,Foxwoods,Musical,2012
30261,17119,99,3,01/03/2016,2940096,147,1,Wicked,9,Gershwin,Musical,2016
28626,16257,100,28,12/28/2014,2903309,154,12,Wicked,9,Gershwin,Musical,2014
...,...,...,...,...,...,...,...,...,...,...,...,...
13023,73,10,3,10/03/2004,3668,10,10,Marc Salem'S Mind Games,1,Lyceum,Special,2004
11749,49,448,23,11/23/2003,2478,4,11,Oldest Living Confederate Widow Tells All,1,Longacre,Play,2003
12541,51,716,30,05/30/2004,1929,5,5,Marc Salem'S Mind Games,1,Lyceum,Special,2004
4225,75,747,25,10/25/1998,1648,5,10,A Mom'S Life,1,Belasco,Special,1998
12509,24,337,23,05/23/2004,1037,3,5,Marc Salem'S Mind Games,0,Lyceum,Special,2004

**What are some interesting takeaways from the previous table?**

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
Ask a question about this dataset that you can solve using the commands we've learned above.
</div>

In [10]:
### YOUR CODE HERE ###

## <font color='red'>2. Functions

Although Python doesn't have a lot of functions and methods by itself, it is not like it doesn't have any. Let's go over some of the most valuable built-in funsctions in Python.

In [11]:
min(1, 3)

1

In [12]:
max(15, 25, 70)

70

You can also use these functions with strings. Can you guess what the output will be?

In [13]:
max("Hamilton", "Washington")

'Washington'

So does Python know that George Washington was older than Alexander Hamilton? Of course not, when comparing strings, Python goes of off the letters of alphabet. Since "W" goes after "H" in the alphabet, "Washington" is a value that is "bigger" than "Hamilton".

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
 We have created two lists with different integers. 
 Let's now find the <b>biggest</b> number among the <b>two smallest numbers in two lists</b>. 
    
 <b>Hint:</b>   let's find the max( ) of the two min( ). You can achieve it with either 3 or 1 line of code.
</div>

In [14]:
dob = [1757, 1756, 1732, 1737, 1754]
dod = [1804, 1836, 1799, 1793, 1782]

In [15]:
### YOUR CODE HERE ###
#min_dob = ...
#min_dod = ...
#max_of_mins = ...
#max_of_mins

In [16]:
# you can do it in one line
### YOUR CODE HERE ###
#max_mins = ...
#max_mins

Another valuable function you can use with your numerals is "round". It will round your floats to the nearest integer. Like so:

In [17]:
round(8.7)

9

Another useful function we can use with numbers is "abs". It outputs an absolute value of a number:

In [18]:
abs(-3.5)

3.5

## <font color='red'>3. Margins of Error (MoEs) in Python

It often makes sense to congregate census categories. For example, in the Excel sheet “Ages” in the workbook “Lab4Data.xlsx” you will find the education information for Census Tract 4004. The information separates the population into 6 age categories. This may be more than we need for the purposes of our analysis, so we are going to consolidate the information into three categories, “Child”, “Working Age Adult”, and “Senior Adult”.

Here is the data we'll be loading in. Don't worry too much about this code—we are importing data from an Excel spreadsheet into a Pandas DataFrame, and then dropping some redundant columns.

In [19]:
data = pd.read_excel('data/Lab4Data_ACS.xlsx', 'Tract_4004')
data2 = pd.read_csv('data/Lab4Data_ACS.csv')

In [20]:
data

                   AGE  Estimate Margin of Error
0        Under 5 years       257          +/-101
1        5 to 17 years       421          +/-125
2       18 to 34 years      1241          +/-204
3       35 to 64 years      1569          +/-140
4       65 to 74 years       329           +/-77
5    75 years and over       169           +/-59
6                Total      3986          +/-250

In [21]:
data2

                 AGE Estimate Margin of Error
0      Under 5 years      257          +/-101
1      5 to 17 years      421          +/-125
2     18 to 34 years    1,241          +/-204
3     35 to 64 years    1,569          +/-140
4     65 to 74 years      329           +/-77
5  75 years and over      169           +/-59
6              Total    3,986          +/-250

In [22]:
data['MOE']=(data['Margin of Error'].str.replace('+', '').str.replace('/','').str.replace('-','')).astype('float')

In [23]:
data

                   AGE  Estimate Margin of Error    MOE
0        Under 5 years       257          +/-101  101.0
1        5 to 17 years       421          +/-125  125.0
2       18 to 34 years      1241          +/-204  204.0
3       35 to 64 years      1569          +/-140  140.0
4       65 to 74 years       329           +/-77   77.0
5    75 years and over       169           +/-59   59.0
6                Total      3986          +/-250  250.0

### Aggregating Age

Let’s create a new column for each of our new categories, and a column for our new categories’ MOEs.
Then let’s congregate our categories by summing estimates across categories.   

“Child” will include “Under 5 years” and “5 to 17 years”.  
“Working Age Adult” will include “18 to 34 years” and “35 to 64 years”.  
“Senior Adult” will include “65 to 74 years” and “75 years and over”.

In [24]:
sum(data.Estimate[0:2])

678

In [25]:
sum(data.Estimate[2:4])

2810

In [26]:
sum(data.Estimate[4:6])

498

In [27]:
# To do this, lets make a new data frame:
aggregated = pd.DataFrame()
aggregated['Age Categories'] = ['Child', 'Working Age Adult', 'Senior Adult', 'Total']
aggregated['Estimate'] = [sum(data.Estimate[0:2]), sum(data.Estimate[2:4]), sum(data.Estimate[4:6]), (data.Estimate[6])]
aggregated

      Age Categories  Estimate
0              Child       678
1  Working Age Adult      2810
2       Senior Adult       498
3              Total      3986

### Aggregating Margins of Error

To calculate the MOE for aggregated count data:
1. Obtain the MOE of each individual estimate.
2. Square the MOE of each estimate.
3. Sum the squared MOEs.
4. Take the square root of the sum of the squared MOEs.

We've written a function called `MOE` that does these steps for us. Make sure you understand how it works!

We can apply the function specifically on the rows corresponding to the "Child" age group, which are the first two rows of our `data`. Remember that when slicing lists, and arrays, the second term is exclusive.

In [28]:
data

                   AGE  Estimate Margin of Error    MOE
0        Under 5 years       257          +/-101  101.0
1        5 to 17 years       421          +/-125  125.0
2       18 to 34 years      1241          +/-204  204.0
3       35 to 64 years      1569          +/-140  140.0
4       65 to 74 years       329           +/-77   77.0
5    75 years and over       169           +/-59   59.0
6                Total      3986          +/-250  250.0

In [29]:
data['MOE'][0:2]

0    101.0
1    125.0
Name: MOE, dtype: float64

In [30]:
101**2

10201

In [31]:
125**2

15625

In [32]:
np.sqrt(sum([10201,15625]))

160.70469812671936

In [33]:
# this is a function to calculate MOE
def MOE(arr):
    sq = arr**2
    return np.sqrt(sum(sq))

In [34]:
# Apply the function above on an array of MOE's you want to aggregate
# For example: age group Child.
agg_moe_child = MOE(data['MOE'][0:2])
agg_moe_child

160.70469812671936

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
 Now, do the same for the "Working Age Adult" and "Senior Adult" categories!
</div>

In [35]:
#agg_moe_adult = ... #FILL IN 
#agg_moe_senior = ... #FILL IN

data['MOE'][6]The cell below puts our calculated `agg_moe_child`, `agg_moe_adult`, `agg_moe_senior` into an array, and then adds that array as a column to our `aggregated` DataFrame.

In [ ]:
data['MOE'][6]

In [ ]:
# Run this cell to produce and view your final aggregated table!
aggregated['MOE'] = np.array([agg_moe_child, agg_moe_adult, agg_moe_senior, data['MOE'][6]])
aggregated

# ADD PROPORTION OF MOE

In [ ]:
# Add proportion of MOE
aggregated['Perc_Est'] = aggregated['Estimate']/(aggregated['Estimate'][3])
aggregated

In [ ]:
sum(aggregated['MOE'])

In [ ]:
np.sqrt((aggregated['MOE']**2)-((aggregated['Perc_Est']**2)*(aggregated['MOE'][3])**2))

In [ ]:
# Add proportion of MOE
aggregated['Perc_MOE'] = np.sqrt((aggregated['MOE']**2)-((aggregated['Perc_Est']**2)*(aggregated['MOE'][3])**2))/(aggregated['Estimate'][3])
aggregated

Finally, you can run this line that will output the aggregated table to a .csv file, so you can use it in other programs!

In [ ]:
aggregated.to_csv('Lab4Agg.csv')